# 时钟约束50MHz
set_property -dict { PACKAGE_PIN P17 IOSTANDARD LVCMOS33 } [get_ports {clk}]; 
create_clock -add -name sys_clk_pin -period 20.00 -waveform {0 10} [get_ports {clk}];
set_input_delay -clock sys_clk_pin 10 [get_ports rst_n]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[6]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[5]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[4]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[3]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[2]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[1]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_0[0]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[6]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[5]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[4]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[3]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[2]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[1]]
# set_output_delay -clock sys_clk_pin 10 [get_ports a_to_g_1[0]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[7]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[6]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[5]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[4]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[3]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[2]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[1]]
# set_output_delay -clock sys_clk_pin 10 [get_ports an[0]]

set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_0[0]}]
set_property PACKAGE_PIN D4 [get_ports {a_to_g_0[6]}]
set_property PACKAGE_PIN E3 [get_ports {a_to_g_0[5]}]
set_property PACKAGE_PIN D3 [get_ports {a_to_g_0[4]}]
set_property PACKAGE_PIN F4 [get_ports {a_to_g_0[3]}]
set_property PACKAGE_PIN F3 [get_ports {a_to_g_0[2]}]
set_property PACKAGE_PIN E2 [get_ports {a_to_g_0[1]}]
set_property PACKAGE_PIN D2 [get_ports {a_to_g_0[0]}]
set_property PACKAGE_PIN B4 [get_ports {a_to_g_1[6]}]
set_property PACKAGE_PIN A4 [get_ports {a_to_g_1[5]}]
set_property PACKAGE_PIN A3 [get_ports {a_to_g_1[4]}]
set_property PACKAGE_PIN B1 [get_ports {a_to_g_1[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {a_to_g_1[0]}]
set_property PACKAGE_PIN A1 [get_ports {a_to_g_1[2]}]
set_property PACKAGE_PIN B3 [get_ports {a_to_g_1[1]}]
set_property PACKAGE_PIN B2 [get_ports {a_to_g_1[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {an[0]}]
set_property PACKAGE_PIN G2 [get_ports {an[7]}]
set_property PACKAGE_PIN C2 [get_ports {an[6]}]
set_property PACKAGE_PIN C1 [get_ports {an[5]}]
set_property PACKAGE_PIN H1 [get_ports {an[4]}]
set_property PACKAGE_PIN G1 [get_ports {an[3]}]
set_property PACKAGE_PIN F1 [get_ports {an[2]}]
set_property PACKAGE_PIN E1 [get_ports {an[1]}]
set_property PACKAGE_PIN G6 [get_ports {an[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports rst_n]
set_property PACKAGE_PIN P17 [get_ports clk]
set_property PACKAGE_PIN U4 [get_ports rst_n]
